app/views/the_gossip_project/home.html.erb

  <body>
    </br><h1><%= "bienvenue, #{User.last.first_name} !"%></h1></br>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]

                <div class="card-body">
                  <h5 class="card-title"><%=obj.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]