app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    <div class="card-header">
      <%=link_to comm.user.first_name%>