app/views/city/show.html.erb

SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1  [["city_id", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN ($1, $2, $3, $4, $5)  [["user_id", 5], ["user_id", 19], ["user_id", 21], ["user_id", 24], ["user_id", 26]]
---

<%users = User.where(city_id: @city)%>
<%gossips = Gossip.where(user_id: users.ids)%>