app/controllers/city_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1  [["city_id", 1]]
---
  def show
    @city = City.find(params[:id])
    @gossips_all = Gossip.all
    @users_all = User.all