app/controllers/comments_controller.rb

  def create
    p params
    permited_params = params.require(:comment).permit(:content)
    Comment.create(permited_params).errors.messages
    Comment.find_by(content: params[:content]).update(user_id: current_user.id, gossip_id: params[:gossip_id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."content" IS NULL LIMIT $1  [["LIMIT", 1]]