app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])
    @gossip_id = Gossip.find(params[:gossip_id])

INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test"], ["user_id", 25], ["gossip_id", 21], ["created_at", "2019-11-01 07:42:47.972478"], ["updated_at", "2019-11-01 07:42:47.972478"]]
---
  def create
    permited_params = params.permit(:content)
    @comment = Comment.create(user: current_user, gossip_id: params[:gossip_id].to_i, content: params[:content])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "testouille"], ["updated_at", "2019-11-01 07:42:56.340373"], ["id", 44]]
---
  def update
    @comment = Comment.find(params[:id])
    permited_params = params.require(:comment).permit( :content)
    if @comment.update(permited_params)