app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Call of Duty"], ["content", "c'est l'edit"], ["updated_at", "2019-10-31 16:48:18.420954"], ["id", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    permited_params = params.require(:gossip).permit(:title, :content)
    if @gossip.update(permited_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]
---
  def show
    id = session[:user_id]
    @user = User.find(id)
    @gossip = Gossip.find(params[:id].to_i)
    @user = Gossip.find(params[:id].to_i).user
    @comment_all = Comment.where(gossip_id: params[:id])

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "testouille"], ["user_id", 25], ["created_at", "2019-10-31 21:09:51.842286"], ["updated_at", "2019-10-31 21:09:51.842286"]]
---
  def create
    @gossip = Gossip.new(user: current_user, title: params["titre"], content: params["potin"])

    if @gossip.save