app/controllers/sign_up_controller.rb

  def sign_up_post
    City.create(name: params["city"])
    User.create(password: params[:password], password_confirmation: params[:password_confirmation], city: City.find_by(name: params["city"]), first_name: params["first_name"], last_name: params["last_name"], age: params["age"], description: params["description"], email: params["email"])
    redirect_to "/landing_page/#{User.last.first_name}"
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Toulon"], ["created_at", "2019-10-31 08:06:02.880817"], ["updated_at", "2019-10-31 08:06:02.880817"]]
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Toulon"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def landing_page
    @user = User.find_by(first_name: params[:user])
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "jean"], ["LIMIT", 1]]