app/controllers/the_gossip_project_controller.rb

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."first_name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def home
    @gossips = Gossip.all
    @user = User.find_by(first_name: params[:user])