app/controllers/user_page_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Freddy"], ["LIMIT", 1]]
---
  def user_page
    @user = User.find_by(first_name: params[:user])